cases/case_1p0_ke/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.5e-12;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            epsilonWallFunction;
        lowReCorrection true;
        blending        stepwise;
        n               2;
        value           uniform 1.5e-12;
    }
    bottomWall
    {
        type            epsilonWallFunction;
        lowReCorrection true;
        blending        stepwise;
        n               2;
        value           uniform 1.5e-12;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
